IRP/src/AccumulationRegisters/R4014B_SerialLotNumber/R4014B_SerialLotNumber.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R4014B_SerialLotNumber</name>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>SerialLotNumber</name>
  <type>
   <types>CatalogRef.SerialLotNumbers</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R4014B_SerialLotNumber/ManagerModule.bsl
#Region Service

Function CheckBalance(Ref, ItemList_InDocument, Records_InDocument, Records_Exists, RecordType, Unposting,
	AddInfo = Undefined) Export

	If Not PostingServer.CheckingBalanceIsRequired(Ref, "CheckBalance_R4014B_SerialLotNumber") Then
		Return True;
	EndIf;

	Query = New Query();
	Query.TempTablesManager = PostingServer.PrepareRecordsTables(GetLockFieldNames(), "ItemKey", ItemList_InDocument,
		Records_InDocument, Records_Exists, Unposting, AddInfo);
	Query.Text =
	"SELECT
	|	ItemList.ItemKey.Item AS Item,
	|	ItemList.ItemKey,
	|	RegisterBalance.Company,
	|	RegisterBalance.Branch,
	|	RegisterBalance.ItemKey,
	|	RegisterBalance.SerialLotNumber,
	|	RegisterBalance.QuantityBalance AS QuantityBalance,
	|	ItemList.Quantity,
	|	-RegisterBalance.QuantityBalance AS LackOfBalance,
	|	ItemList.LineNumber AS LineNumber,
	|	&Unposting AS Unposting
	|FROM
	|	ItemList AS ItemList
	|		INNER JOIN AccumulationRegister.R4014B_SerialLotNumber.Balance(, (Company, Branch, ItemKey, SerialLotNumber) IN
	|			(SELECT
	|				ItemList.Company,
	|				ItemList.Branch,
	|				ItemList.ItemKey,
	|				ItemList.SerialLotNumber
	|			FROM
	|				ItemList AS ItemList)) AS RegisterBalance
	|		ON RegisterBalance.Company = ItemList.Company
	|		AND RegisterBalance.Branch = ItemList.Branch
	|		AND RegisterBalance.ItemKey = ItemList.ItemKey
	|		AND RegisterBalance.SerialLotNumber = ItemList.SerialLotNumber
	|WHERE
	|	RegisterBalance.QuantityBalance < 0
	|ORDER BY
	|	LineNumber";
	Query.SetParameter("Unposting", Unposting);
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();

	Error = False;
	If QueryTable.Count() Then
		Error = True;
		ErrorParameters = New Structure();
		ErrorParameters.Insert("GroupColumns", "Company, Branch, ItemKey, SerialLotNumber, Item, LackOfBalance");
		ErrorParameters.Insert("SumColumns", "Quantity");
		ErrorParameters.Insert("FilterColumns", "Company, Branch, ItemKey, SerialLotNumber, Item, LackOfBalance");
		ErrorParameters.Insert("Operation", "Serial lot number");
		ErrorParameters.Insert("RecordType", RecordType);
		PostingServer.ShowPostingErrorMessage(QueryTable, ErrorParameters, AddInfo);
	EndIf;
	Return Not Error;
EndFunction

#EndRegion
